program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "2.1.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios17>(tensor<fp16, [1, 80, 1, 3000]> melspectrogram_features) {
            tensor<int32, [2]> var_38 = const()[name = tensor<string, []>("op_38"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_44 = const()[name = tensor<string, []>("op_44"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_49 = const()[name = tensor<string, []>("op_49"), val = tensor<int32, []>(1)];
            tensor<string, []> var_54_pad_type_0 = const()[name = tensor<string, []>("op_54_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_54_pad_0 = const()[name = tensor<string, []>("op_54_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [512, 80, 1, 3]> var_29_to_fp16 = const()[name = tensor<string, []>("op_29_to_fp16"), val = tensor<fp16, [512, 80, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [512]> var_35_to_fp16 = const()[name = tensor<string, []>("op_35_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(245888)))];
            tensor<fp16, [1, 512, 1, 3000]> var_54_cast_fp16 = conv(bias = var_35_to_fp16, dilations = var_44, groups = var_49, pad = var_54_pad_0, pad_type = var_54_pad_type_0, strides = var_38, weight = var_29_to_fp16, x = melspectrogram_features)[name = tensor<string, []>("op_54_cast_fp16")];
            tensor<string, []> hidden_states_1_mode_0 = const()[name = tensor<string, []>("hidden_states_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1, 3000]> hidden_states_1_cast_fp16 = gelu(mode = hidden_states_1_mode_0, x = var_54_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [2]> var_78 = const()[name = tensor<string, []>("op_78"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, []>(1)];
            tensor<string, []> var_94_pad_type_0 = const()[name = tensor<string, []>("op_94_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_94_pad_0 = const()[name = tensor<string, []>("op_94_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [512, 512, 1, 3]> var_69_to_fp16 = const()[name = tensor<string, []>("op_69_to_fp16"), val = tensor<fp16, [512, 512, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(246976)))];
            tensor<fp16, [512]> var_75_to_fp16 = const()[name = tensor<string, []>("op_75_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1819904)))];
            tensor<fp16, [1, 512, 1, 1500]> var_94_cast_fp16 = conv(bias = var_75_to_fp16, dilations = var_84, groups = var_89, pad = var_94_pad_0, pad_type = var_94_pad_type_0, strides = var_78, weight = var_69_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_94_cast_fp16")];
            tensor<string, []> hidden_states_3_mode_0 = const()[name = tensor<string, []>("hidden_states_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1, 1500]> hidden_states_3_cast_fp16 = gelu(mode = hidden_states_3_mode_0, x = var_94_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> var_112_to_fp16 = const()[name = tensor<string, []>("op_112_to_fp16"), val = tensor<fp16, [1, 512, 1, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1820992)))];
            tensor<fp16, [1, 512, 1, 1500]> inputs_1_cast_fp16 = add(x = hidden_states_3_cast_fp16, y = var_112_to_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_146 = const()[name = tensor<string, []>("op_146"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_146, keep_dims = var_136, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_151_cast_fp16 = reduce_mean(axes = var_150, keep_dims = var_136, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_151_cast_fp16")];
            tensor<fp16, []> var_152_to_fp16 = const()[name = tensor<string, []>("op_152_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_153_cast_fp16 = add(x = var_151_cast_fp16, y = var_152_to_fp16)[name = tensor<string, []>("op_153_cast_fp16")];
            tensor<fp32, []> denom_1_epsilon_0 = const()[name = tensor<string, []>("denom_1_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0, x = var_153_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [512]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3357056)))];
            tensor<fp16, [512]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3358144)))];
            tensor<fp16, [512]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3359232)))];
            tensor<fp16, [512]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3360320)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<int32, [2]> var_168 = const()[name = tensor<string, []>("op_168"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_170 = const()[name = tensor<string, []>("op_170"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_1_pad_type_0 = const()[name = tensor<string, []>("query_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_1_pad_0 = const()[name = tensor<string, []>("query_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3361408)))];
            tensor<fp16, [512]> layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3885760)))];
            tensor<fp16, [1, 512, 1, 1500]> query_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_bias_to_fp16, dilations = var_170, groups = var_135, pad = query_1_pad_0, pad_type = query_1_pad_type_0, strides = var_168, weight = layers_0_self_attn_q_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<int32, [2]> var_174 = const()[name = tensor<string, []>("op_174"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_176 = const()[name = tensor<string, []>("op_176"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> key_1_pad_type_0 = const()[name = tensor<string, []>("key_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> key_1_pad_0 = const()[name = tensor<string, []>("key_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3886848)))];
            tensor<fp16, [1, 512, 1, 1500]> key_1_cast_fp16 = conv(dilations = var_176, groups = var_135, pad = key_1_pad_0, pad_type = key_1_pad_type_0, strides = var_174, weight = layers_0_self_attn_k_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<int32, [2]> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> value_1_pad_type_0 = const()[name = tensor<string, []>("value_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> value_1_pad_0 = const()[name = tensor<string, []>("value_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4411200)))];
            tensor<fp16, [512]> layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4935552)))];
            tensor<fp16, [1, 512, 1, 1500]> value_1_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_bias_to_fp16, dilations = var_183, groups = var_135, pad = value_1_pad_0, pad_type = value_1_pad_type_0, strides = var_181, weight = layers_0_self_attn_v_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_190_begin_0 = const()[name = tensor<string, []>("op_190_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_190_end_0 = const()[name = tensor<string, []>("op_190_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_190_end_mask_0 = const()[name = tensor<string, []>("op_190_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_190_cast_fp16 = slice_by_index(begin = var_190_begin_0, end = var_190_end_0, end_mask = var_190_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<int32, [4]> var_194_begin_0 = const()[name = tensor<string, []>("op_194_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_194_end_0 = const()[name = tensor<string, []>("op_194_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1500])];
            tensor<bool, [4]> var_194_end_mask_0 = const()[name = tensor<string, []>("op_194_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_194_cast_fp16 = slice_by_index(begin = var_194_begin_0, end = var_194_end_0, end_mask = var_194_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_194_cast_fp16")];
            tensor<int32, [4]> var_198_begin_0 = const()[name = tensor<string, []>("op_198_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_198_end_0 = const()[name = tensor<string, []>("op_198_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1500])];
            tensor<bool, [4]> var_198_end_mask_0 = const()[name = tensor<string, []>("op_198_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_198_cast_fp16 = slice_by_index(begin = var_198_begin_0, end = var_198_end_0, end_mask = var_198_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<int32, [4]> var_202_begin_0 = const()[name = tensor<string, []>("op_202_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_202_end_0 = const()[name = tensor<string, []>("op_202_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1500])];
            tensor<bool, [4]> var_202_end_mask_0 = const()[name = tensor<string, []>("op_202_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_202_cast_fp16 = slice_by_index(begin = var_202_begin_0, end = var_202_end_0, end_mask = var_202_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<int32, [4]> var_206_begin_0 = const()[name = tensor<string, []>("op_206_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_206_end_0 = const()[name = tensor<string, []>("op_206_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1500])];
            tensor<bool, [4]> var_206_end_mask_0 = const()[name = tensor<string, []>("op_206_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_206_cast_fp16 = slice_by_index(begin = var_206_begin_0, end = var_206_end_0, end_mask = var_206_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [4]> var_210_begin_0 = const()[name = tensor<string, []>("op_210_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_210_end_0 = const()[name = tensor<string, []>("op_210_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1500])];
            tensor<bool, [4]> var_210_end_mask_0 = const()[name = tensor<string, []>("op_210_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_210_cast_fp16 = slice_by_index(begin = var_210_begin_0, end = var_210_end_0, end_mask = var_210_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [4]> var_214_begin_0 = const()[name = tensor<string, []>("op_214_begin_0"), val = tensor<int32, [4]>([0, 384, 0, 0])];
            tensor<int32, [4]> var_214_end_0 = const()[name = tensor<string, []>("op_214_end_0"), val = tensor<int32, [4]>([1, 448, 1, 1500])];
            tensor<bool, [4]> var_214_end_mask_0 = const()[name = tensor<string, []>("op_214_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_214_cast_fp16 = slice_by_index(begin = var_214_begin_0, end = var_214_end_0, end_mask = var_214_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<int32, [4]> var_218_begin_0 = const()[name = tensor<string, []>("op_218_begin_0"), val = tensor<int32, [4]>([0, 448, 0, 0])];
            tensor<int32, [4]> var_218_end_0 = const()[name = tensor<string, []>("op_218_end_0"), val = tensor<int32, [4]>([1, 512, 1, 1500])];
            tensor<bool, [4]> var_218_end_mask_0 = const()[name = tensor<string, []>("op_218_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_218_cast_fp16 = slice_by_index(begin = var_218_begin_0, end = var_218_end_0, end_mask = var_218_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_218_cast_fp16")];
            tensor<int32, [4]> var_227_begin_0 = const()[name = tensor<string, []>("op_227_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_227_end_0 = const()[name = tensor<string, []>("op_227_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_227_end_mask_0 = const()[name = tensor<string, []>("op_227_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_227_cast_fp16 = slice_by_index(begin = var_227_begin_0, end = var_227_end_0, end_mask = var_227_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_227_cast_fp16")];
            tensor<int32, [4]> var_234_begin_0 = const()[name = tensor<string, []>("op_234_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_234_end_0 = const()[name = tensor<string, []>("op_234_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_234_end_mask_0 = const()[name = tensor<string, []>("op_234_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_234_cast_fp16 = slice_by_index(begin = var_234_begin_0, end = var_234_end_0, end_mask = var_234_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<int32, [4]> var_241_begin_0 = const()[name = tensor<string, []>("op_241_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_241_end_0 = const()[name = tensor<string, []>("op_241_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_241_end_mask_0 = const()[name = tensor<string, []>("op_241_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_241_cast_fp16 = slice_by_index(begin = var_241_begin_0, end = var_241_end_0, end_mask = var_241_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_241_cast_fp16")];
            tensor<int32, [4]> var_248_begin_0 = const()[name = tensor<string, []>("op_248_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_248_end_0 = const()[name = tensor<string, []>("op_248_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_248_end_mask_0 = const()[name = tensor<string, []>("op_248_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_248_cast_fp16 = slice_by_index(begin = var_248_begin_0, end = var_248_end_0, end_mask = var_248_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_248_cast_fp16")];
            tensor<int32, [4]> var_255_begin_0 = const()[name = tensor<string, []>("op_255_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_255_end_0 = const()[name = tensor<string, []>("op_255_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_255_end_mask_0 = const()[name = tensor<string, []>("op_255_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_255_cast_fp16 = slice_by_index(begin = var_255_begin_0, end = var_255_end_0, end_mask = var_255_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<int32, [4]> var_262_begin_0 = const()[name = tensor<string, []>("op_262_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_262_end_0 = const()[name = tensor<string, []>("op_262_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_262_end_mask_0 = const()[name = tensor<string, []>("op_262_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_262_cast_fp16 = slice_by_index(begin = var_262_begin_0, end = var_262_end_0, end_mask = var_262_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<int32, [4]> var_269_begin_0 = const()[name = tensor<string, []>("op_269_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_269_end_0 = const()[name = tensor<string, []>("op_269_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_269_end_mask_0 = const()[name = tensor<string, []>("op_269_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_269_cast_fp16 = slice_by_index(begin = var_269_begin_0, end = var_269_end_0, end_mask = var_269_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_269_cast_fp16")];
            tensor<int32, [4]> var_276_begin_0 = const()[name = tensor<string, []>("op_276_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_276_end_0 = const()[name = tensor<string, []>("op_276_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_276_end_mask_0 = const()[name = tensor<string, []>("op_276_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_276_cast_fp16 = slice_by_index(begin = var_276_begin_0, end = var_276_end_0, end_mask = var_276_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<int32, [4]> var_283_begin_0 = const()[name = tensor<string, []>("op_283_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_283_end_0 = const()[name = tensor<string, []>("op_283_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_283_end_mask_0 = const()[name = tensor<string, []>("op_283_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_283_cast_fp16 = slice_by_index(begin = var_283_begin_0, end = var_283_end_0, end_mask = var_283_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_283_cast_fp16")];
            tensor<int32, [4]> var_290_begin_0 = const()[name = tensor<string, []>("op_290_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_290_end_0 = const()[name = tensor<string, []>("op_290_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_290_end_mask_0 = const()[name = tensor<string, []>("op_290_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_290_cast_fp16 = slice_by_index(begin = var_290_begin_0, end = var_290_end_0, end_mask = var_290_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_290_cast_fp16")];
            tensor<int32, [4]> var_297_begin_0 = const()[name = tensor<string, []>("op_297_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_297_end_0 = const()[name = tensor<string, []>("op_297_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_297_end_mask_0 = const()[name = tensor<string, []>("op_297_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_297_cast_fp16 = slice_by_index(begin = var_297_begin_0, end = var_297_end_0, end_mask = var_297_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_297_cast_fp16")];
            tensor<int32, [4]> var_304_begin_0 = const()[name = tensor<string, []>("op_304_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_304_end_0 = const()[name = tensor<string, []>("op_304_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_304_end_mask_0 = const()[name = tensor<string, []>("op_304_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_304_cast_fp16 = slice_by_index(begin = var_304_begin_0, end = var_304_end_0, end_mask = var_304_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_304_cast_fp16")];
            tensor<int32, [4]> var_311_begin_0 = const()[name = tensor<string, []>("op_311_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_311_end_0 = const()[name = tensor<string, []>("op_311_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_311_end_mask_0 = const()[name = tensor<string, []>("op_311_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_311_cast_fp16 = slice_by_index(begin = var_311_begin_0, end = var_311_end_0, end_mask = var_311_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_311_cast_fp16")];
            tensor<int32, [4]> var_318_begin_0 = const()[name = tensor<string, []>("op_318_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_318_end_0 = const()[name = tensor<string, []>("op_318_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_318_end_mask_0 = const()[name = tensor<string, []>("op_318_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_318_cast_fp16 = slice_by_index(begin = var_318_begin_0, end = var_318_end_0, end_mask = var_318_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_318_cast_fp16")];
            tensor<int32, [4]> var_325_begin_0 = const()[name = tensor<string, []>("op_325_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_325_end_0 = const()[name = tensor<string, []>("op_325_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_325_end_mask_0 = const()[name = tensor<string, []>("op_325_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_325_cast_fp16 = slice_by_index(begin = var_325_begin_0, end = var_325_end_0, end_mask = var_325_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_325_cast_fp16")];
            tensor<int32, [4]> var_332_begin_0 = const()[name = tensor<string, []>("op_332_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_332_end_0 = const()[name = tensor<string, []>("op_332_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_332_end_mask_0 = const()[name = tensor<string, []>("op_332_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_332_cast_fp16 = slice_by_index(begin = var_332_begin_0, end = var_332_end_0, end_mask = var_332_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_332_cast_fp16")];
            tensor<int32, [4]> var_339_begin_0 = const()[name = tensor<string, []>("op_339_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_339_end_0 = const()[name = tensor<string, []>("op_339_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_339_end_mask_0 = const()[name = tensor<string, []>("op_339_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_339_cast_fp16 = slice_by_index(begin = var_339_begin_0, end = var_339_end_0, end_mask = var_339_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_339_cast_fp16")];
            tensor<int32, [4]> var_346_begin_0 = const()[name = tensor<string, []>("op_346_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_346_end_0 = const()[name = tensor<string, []>("op_346_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_346_end_mask_0 = const()[name = tensor<string, []>("op_346_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_346_cast_fp16 = slice_by_index(begin = var_346_begin_0, end = var_346_end_0, end_mask = var_346_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_346_cast_fp16")];
            tensor<int32, [4]> var_353_begin_0 = const()[name = tensor<string, []>("op_353_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_353_end_0 = const()[name = tensor<string, []>("op_353_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_353_end_mask_0 = const()[name = tensor<string, []>("op_353_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_353_cast_fp16 = slice_by_index(begin = var_353_begin_0, end = var_353_end_0, end_mask = var_353_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_353_cast_fp16")];
            tensor<int32, [4]> var_360_begin_0 = const()[name = tensor<string, []>("op_360_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_360_end_0 = const()[name = tensor<string, []>("op_360_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_360_end_mask_0 = const()[name = tensor<string, []>("op_360_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_360_cast_fp16 = slice_by_index(begin = var_360_begin_0, end = var_360_end_0, end_mask = var_360_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<int32, [4]> var_367_begin_0 = const()[name = tensor<string, []>("op_367_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_367_end_0 = const()[name = tensor<string, []>("op_367_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_367_end_mask_0 = const()[name = tensor<string, []>("op_367_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_367_cast_fp16 = slice_by_index(begin = var_367_begin_0, end = var_367_end_0, end_mask = var_367_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_367_cast_fp16")];
            tensor<int32, [4]> var_374_begin_0 = const()[name = tensor<string, []>("op_374_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_374_end_0 = const()[name = tensor<string, []>("op_374_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_374_end_mask_0 = const()[name = tensor<string, []>("op_374_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_374_cast_fp16 = slice_by_index(begin = var_374_begin_0, end = var_374_end_0, end_mask = var_374_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_374_cast_fp16")];
            tensor<int32, [4]> var_381_begin_0 = const()[name = tensor<string, []>("op_381_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_381_end_0 = const()[name = tensor<string, []>("op_381_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_381_end_mask_0 = const()[name = tensor<string, []>("op_381_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_381_cast_fp16 = slice_by_index(begin = var_381_begin_0, end = var_381_end_0, end_mask = var_381_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_381_cast_fp16")];
            tensor<int32, [4]> var_388_begin_0 = const()[name = tensor<string, []>("op_388_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_388_end_0 = const()[name = tensor<string, []>("op_388_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_388_end_mask_0 = const()[name = tensor<string, []>("op_388_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_388_cast_fp16 = slice_by_index(begin = var_388_begin_0, end = var_388_end_0, end_mask = var_388_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_388_cast_fp16")];
            tensor<int32, [4]> var_395_begin_0 = const()[name = tensor<string, []>("op_395_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_395_end_0 = const()[name = tensor<string, []>("op_395_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_395_end_mask_0 = const()[name = tensor<string, []>("op_395_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_395_cast_fp16 = slice_by_index(begin = var_395_begin_0, end = var_395_end_0, end_mask = var_395_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_395_cast_fp16")];
            tensor<int32, [4]> var_402_begin_0 = const()[name = tensor<string, []>("op_402_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_402_end_0 = const()[name = tensor<string, []>("op_402_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_402_end_mask_0 = const()[name = tensor<string, []>("op_402_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_402_cast_fp16 = slice_by_index(begin = var_402_begin_0, end = var_402_end_0, end_mask = var_402_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_402_cast_fp16")];
            tensor<int32, [4]> var_409_begin_0 = const()[name = tensor<string, []>("op_409_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_409_end_0 = const()[name = tensor<string, []>("op_409_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_409_end_mask_0 = const()[name = tensor<string, []>("op_409_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_409_cast_fp16 = slice_by_index(begin = var_409_begin_0, end = var_409_end_0, end_mask = var_409_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_409_cast_fp16")];
            tensor<int32, [4]> var_416_begin_0 = const()[name = tensor<string, []>("op_416_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_416_end_0 = const()[name = tensor<string, []>("op_416_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_416_end_mask_0 = const()[name = tensor<string, []>("op_416_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_416_cast_fp16 = slice_by_index(begin = var_416_begin_0, end = var_416_end_0, end_mask = var_416_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_416_cast_fp16")];
            tensor<int32, [4]> var_423_begin_0 = const()[name = tensor<string, []>("op_423_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_423_end_0 = const()[name = tensor<string, []>("op_423_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_423_end_mask_0 = const()[name = tensor<string, []>("op_423_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_423_cast_fp16 = slice_by_index(begin = var_423_begin_0, end = var_423_end_0, end_mask = var_423_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_423_cast_fp16")];
            tensor<int32, [4]> var_430_begin_0 = const()[name = tensor<string, []>("op_430_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_430_end_0 = const()[name = tensor<string, []>("op_430_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_430_end_mask_0 = const()[name = tensor<string, []>("op_430_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_430_cast_fp16 = slice_by_index(begin = var_430_begin_0, end = var_430_end_0, end_mask = var_430_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_430_cast_fp16")];
            tensor<int32, [4]> var_437_begin_0 = const()[name = tensor<string, []>("op_437_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_437_end_0 = const()[name = tensor<string, []>("op_437_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_437_end_mask_0 = const()[name = tensor<string, []>("op_437_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_437_cast_fp16 = slice_by_index(begin = var_437_begin_0, end = var_437_end_0, end_mask = var_437_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_437_cast_fp16")];
            tensor<int32, [4]> var_444_begin_0 = const()[name = tensor<string, []>("op_444_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_444_end_0 = const()[name = tensor<string, []>("op_444_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_444_end_mask_0 = const()[name = tensor<string, []>("op_444_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_444_cast_fp16 = slice_by_index(begin = var_444_begin_0, end = var_444_end_0, end_mask = var_444_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_444_cast_fp16")];
            tensor<int32, [4]> k_1_perm_0 = const()[name = tensor<string, []>("k_1_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [4]> var_449_begin_0 = const()[name = tensor<string, []>("op_449_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_449_end_0 = const()[name = tensor<string, []>("op_449_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 64])];
            tensor<bool, [4]> var_449_end_mask_0 = const()[name = tensor<string, []>("op_449_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 512]> transpose_5 = transpose(perm = k_1_perm_0, x = key_1_cast_fp16)[name = tensor<string, []>("transpose_5")];
            tensor<fp16, [1, 1500, 1, 64]> var_449_cast_fp16 = slice_by_index(begin = var_449_begin_0, end = var_449_end_0, end_mask = var_449_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_449_cast_fp16")];
            tensor<int32, [4]> var_453_begin_0 = const()[name = tensor<string, []>("op_453_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 64])];
            tensor<int32, [4]> var_453_end_0 = const()[name = tensor<string, []>("op_453_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 128])];
            tensor<bool, [4]> var_453_end_mask_0 = const()[name = tensor<string, []>("op_453_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_453_cast_fp16 = slice_by_index(begin = var_453_begin_0, end = var_453_end_0, end_mask = var_453_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_453_cast_fp16")];
            tensor<int32, [4]> var_457_begin_0 = const()[name = tensor<string, []>("op_457_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 128])];
            tensor<int32, [4]> var_457_end_0 = const()[name = tensor<string, []>("op_457_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 192])];
            tensor<bool, [4]> var_457_end_mask_0 = const()[name = tensor<string, []>("op_457_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_457_cast_fp16 = slice_by_index(begin = var_457_begin_0, end = var_457_end_0, end_mask = var_457_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_457_cast_fp16")];
            tensor<int32, [4]> var_461_begin_0 = const()[name = tensor<string, []>("op_461_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 192])];
            tensor<int32, [4]> var_461_end_0 = const()[name = tensor<string, []>("op_461_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 256])];
            tensor<bool, [4]> var_461_end_mask_0 = const()[name = tensor<string, []>("op_461_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_461_cast_fp16 = slice_by_index(begin = var_461_begin_0, end = var_461_end_0, end_mask = var_461_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_461_cast_fp16")];
            tensor<int32, [4]> var_465_begin_0 = const()[name = tensor<string, []>("op_465_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_465_end_0 = const()[name = tensor<string, []>("op_465_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 320])];
            tensor<bool, [4]> var_465_end_mask_0 = const()[name = tensor<string, []>("op_465_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_465_cast_fp16 = slice_by_index(begin = var_465_begin_0, end = var_465_end_0, end_mask = var_465_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_465_cast_fp16")];
            tensor<int32, [4]> var_469_begin_0 = const()[name = tensor<string, []>("op_469_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 320])];
            tensor<int32, [4]> var_469_end_0 = const()[name = tensor<string, []>("op_469_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 384])];
            tensor<bool, [4]> var_469_end_mask_0 = const()[name = tensor<string, []>("op_469_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_469_cast_fp16 = slice_by_index(begin = var_469_begin_0, end = var_469_end_0, end_mask = var_469_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_469_cast_fp16")];
            tensor<int32, [4]> var_473_begin_0 = const()[name = tensor<string, []>("op_473_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 384])];
            tensor<int32, [4]> var_473_end_0 = const()[name = tensor<string, []>("op_473_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 448])];
            tensor<bool, [4]> var_473_end_mask_0 = const()[name = tensor<string, []>("op_473_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_473_cast_fp16 = slice_by_index(begin = var_473_begin_0, end = var_473_end_0, end_mask = var_473_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_473_cast_fp16")];
            tensor<int32, [4]> var_477_begin_0 = const()[name = tensor<string, []>("op_477_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 448])];
            tensor<int32, [4]> var_477_end_0 = const()[name = tensor<string, []>("op_477_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 512])];
            tensor<bool, [4]> var_477_end_mask_0 = const()[name = tensor<string, []>("op_477_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 64]> var_477_cast_fp16 = slice_by_index(begin = var_477_begin_0, end = var_477_end_0, end_mask = var_477_end_mask_0, x = transpose_5)[name = tensor<string, []>("op_477_cast_fp16")];
            tensor<int32, [4]> var_479_begin_0 = const()[name = tensor<string, []>("op_479_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_479_end_0 = const()[name = tensor<string, []>("op_479_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_479_end_mask_0 = const()[name = tensor<string, []>("op_479_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_479_cast_fp16 = slice_by_index(begin = var_479_begin_0, end = var_479_end_0, end_mask = var_479_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_479_cast_fp16")];
            tensor<int32, [4]> var_483_begin_0 = const()[name = tensor<string, []>("op_483_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_483_end_0 = const()[name = tensor<string, []>("op_483_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1500])];
            tensor<bool, [4]> var_483_end_mask_0 = const()[name = tensor<string, []>("op_483_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_483_cast_fp16 = slice_by_index(begin = var_483_begin_0, end = var_483_end_0, end_mask = var_483_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_483_cast_fp16")];
            tensor<int32, [4]> var_487_begin_0 = const()[name = tensor<string, []>("op_487_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_487_end_0 = const()[name = tensor<string, []>("op_487_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1500])];
            tensor<bool, [4]> var_487_end_mask_0 = const()[name = tensor<string, []>("op_487_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_487_cast_fp16 = slice_by_index(begin = var_487_begin_0, end = var_487_end_0, end_mask = var_487_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_487_cast_fp16")];
            tensor<int32, [4]> var_491_begin_0 = const()[name = tensor<string, []>("op_491_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_491_end_0 = const()[name = tensor<string, []>("op_491_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1500])];
            tensor<bool, [4]> var_491_end_mask_0 = const()[name = tensor<string, []>("op_491_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_491_cast_fp16 = slice_by_index(begin = var_491_begin_0, end = var_491_end_0, end_mask = var_491_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_491_cast_fp16")];
            tensor<int32, [4]> var_495_begin_0 = const()[name = tensor<string, []>("op_495_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_495_end_0 = const()[name = tensor<string, []>("op_495_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1500])];
            tensor<bool, [4]> var_495_end_mask_0 = const()[name = tensor<string, []>("op_495_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_495_cast_fp16 = slice_by_index(begin = var_495_begin_0, end = var_495_end_0, end_mask = var_495_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_495_cast_fp16")];
            tensor<int32, [4]> var_499_begin_0 = const()[name = tensor<string, []>("op_499_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_499_end_0 = const()[name = tensor<string, []>("op_499_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1500])];
            tensor<bool, [4]> var_499_end_mask_0 = const()[name = tensor<string, []>("op_499_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_499_cast_fp16 = slice_by_index(begin = var_499_begin_0, end = var_499_end_0, end_mask = var_499_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_499_cast_fp16")];
            tensor<int32, [4]> var_503_begin_0 = const()[name = tensor<string, []>("op_503_begin_0"), val = tensor<int32, [4]>([0, 384, 0, 0])];
            tensor<int32, [4]> var_503_end_0 = const()[name = tensor<string, []>("op_503_end_0"), val = tensor<int32, [4]>([1, 448, 1, 1500])];
            tensor<bool, [4]> var_503_end_mask_0 = const()[name = tensor<string, []>("op_503_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_503_cast_fp16 = slice_by_index(begin = var_503_begin_0, end = var_503_end_0, end_mask = var_503_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_503_cast_fp16")];
            tensor<int32, [4]> var_507_begin_0 = const()[name = tensor<string, []>("op_507_begin_0"), val = tensor<int32, [4]>([0, 448, 0, 0])];
            tensor<int32, [4]> var_507_end_0 = const()[name = tensor<string, []>("op_507_end_0"), val = tensor<int32, [4]>([1, 512, 1, 1500])];
            tensor<bool, [4]> var_507_end_mask_0 = const()[name = tensor<string, []>("op_507_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_507_cast_fp16 = slice_by_index(begin = var_507_begin_0, end = var_507_end_0, end_mask = var_507_end_mask_0, x = value_1_cast_fp16)[name = tensor<string, []>("op_507_cast_fp16")];
