program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "2.1.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios17>(tensor<int32, [1]> cache_length, tensor<fp16, [1, 224]> decoder_key_padding_mask, tensor<fp16, [1, 512, 1, 1500]> encoder_output_embeds, tensor<int32, [1]> input_ids, tensor<fp16, [1, 3072, 1, 224]> key_cache, tensor<fp16, [1, 224]> kv_cache_update_mask, tensor<fp16, [1, 3072, 1, 224]> value_cache) {
            tensor<int32, []> var_28_axis_0 = const()[name = tensor<string, []>("op_28_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_28_batch_dims_0 = const()[name = tensor<string, []>("op_28_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_28_validate_indices_0 = const()[name = tensor<string, []>("op_28_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51864, 512]> embed_tokens_weight_to_fp16 = const()[name = tensor<string, []>("embed_tokens_weight_to_fp16"), val = tensor<fp16, [51864, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 512]> var_28_cast_fp16 = gather(axis = var_28_axis_0, batch_dims = var_28_batch_dims_0, indices = input_ids, validate_indices = var_28_validate_indices_0, x = embed_tokens_weight_to_fp16)[name = tensor<string, []>("op_28_cast_fp16")];
            tensor<int32, []> var_32_axis_0 = const()[name = tensor<string, []>("op_32_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_32_batch_dims_0 = const()[name = tensor<string, []>("op_32_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_32_validate_indices_0 = const()[name = tensor<string, []>("op_32_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [448, 512]> embed_positions_weight_to_fp16 = const()[name = tensor<string, []>("embed_positions_weight_to_fp16"), val = tensor<fp16, [448, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53108864)))];
            tensor<string, []> cache_length_to_int16_dtype_0 = const()[name = tensor<string, []>("cache_length_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<int16, [1]> cast_96 = cast(dtype = cache_length_to_int16_dtype_0, x = cache_length)[name = tensor<string, []>("cast_96")];
            tensor<fp16, [1, 512]> var_32_cast_fp16_cast_int16 = gather(axis = var_32_axis_0, batch_dims = var_32_batch_dims_0, indices = cast_96, validate_indices = var_32_validate_indices_0, x = embed_positions_weight_to_fp16)[name = tensor<string, []>("op_32_cast_fp16_cast_int16")];
            tensor<fp16, [1, 512]> hidden_states_1_cast_fp16 = add(x = var_28_cast_fp16, y = var_32_cast_fp16_cast_int16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [1]> var_46_axes_0 = const()[name = tensor<string, []>("op_46_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 512, 1]> var_46_cast_fp16 = expand_dims(axes = var_46_axes_0, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_46_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 512, 1, 1]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_46_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, [6]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [6]>([512, 512, 512, 512, 512, 512])];
            tensor<int32, []> var_51_axis_0 = const()[name = tensor<string, []>("op_51_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 512, 1, 224]> var_51_cast_fp16_0, tensor<fp16, [1, 512, 1, 224]> var_51_cast_fp16_1, tensor<fp16, [1, 512, 1, 224]> var_51_cast_fp16_2, tensor<fp16, [1, 512, 1, 224]> var_51_cast_fp16_3, tensor<fp16, [1, 512, 1, 224]> var_51_cast_fp16_4, tensor<fp16, [1, 512, 1, 224]> var_51_cast_fp16_5 = split(axis = var_51_axis_0, split_sizes = tile_0, x = key_cache)[name = tensor<string, []>("op_51_cast_fp16")];
            tensor<int32, [6]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [6]>([512, 512, 512, 512, 512, 512])];
            tensor<int32, []> var_60_axis_0 = const()[name = tensor<string, []>("op_60_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 512, 1, 224]> var_60_cast_fp16_0, tensor<fp16, [1, 512, 1, 224]> var_60_cast_fp16_1, tensor<fp16, [1, 512, 1, 224]> var_60_cast_fp16_2, tensor<fp16, [1, 512, 1, 224]> var_60_cast_fp16_3, tensor<fp16, [1, 512, 1, 224]> var_60_cast_fp16_4, tensor<fp16, [1, 512, 1, 224]> var_60_cast_fp16_5 = split(axis = var_60_axis_0, split_sizes = tile_1, x = value_cache)[name = tensor<string, []>("op_60_cast_fp16")];
            tensor<int32, []> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_79 = const()[name = tensor<string, []>("op_79"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_92, keep_dims = var_80, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_96 = const()[name = tensor<string, []>("op_96"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> var_97_cast_fp16 = reduce_mean(axes = var_96, keep_dims = var_80, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_97_cast_fp16")];
            tensor<fp16, []> var_98_to_fp16 = const()[name = tensor<string, []>("op_98_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1]> var_99_cast_fp16 = add(x = var_97_cast_fp16, y = var_98_to_fp16)[name = tensor<string, []>("op_99_cast_fp16")];
            tensor<fp32, []> denom_1_epsilon_0 = const()[name = tensor<string, []>("denom_1_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0, x = var_99_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [512]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53567680)))];
            tensor<fp16, [512]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53568768)))];
            tensor<fp16, [512]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53569856)))];
            tensor<fp16, [512]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53570944)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<int32, [2]> var_114 = const()[name = tensor<string, []>("op_114"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_1_pad_type_0 = const()[name = tensor<string, []>("query_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_1_pad_0 = const()[name = tensor<string, []>("query_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53572032)))];
            tensor<fp16, [512]> layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54096384)))];
            tensor<fp16, [1, 512, 1, 1]> query_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_bias_to_fp16, dilations = var_116, groups = var_79, pad = query_1_pad_0, pad_type = query_1_pad_type_0, strides = var_114, weight = layers_0_self_attn_q_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<int32, [2]> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> current_key_1_pad_type_0 = const()[name = tensor<string, []>("current_key_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> current_key_1_pad_0 = const()[name = tensor<string, []>("current_key_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54097472)))];
            tensor<fp16, [1, 512, 1, 1]> current_key_1_cast_fp16 = conv(dilations = var_122, groups = var_79, pad = current_key_1_pad_0, pad_type = current_key_1_pad_type_0, strides = var_120, weight = layers_0_self_attn_k_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("current_key_1_cast_fp16")];
            tensor<int32, [2]> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> current_value_1_pad_type_0 = const()[name = tensor<string, []>("current_value_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> current_value_1_pad_0 = const()[name = tensor<string, []>("current_value_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54621824)))];
            tensor<fp16, [512]> layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55146176)))];
            tensor<fp16, [1, 512, 1, 1]> current_value_1_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_bias_to_fp16, dilations = var_129, groups = var_79, pad = current_value_1_pad_0, pad_type = current_value_1_pad_type_0, strides = var_127, weight = layers_0_self_attn_v_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("current_value_1_cast_fp16")];
            tensor<int32, [1]> var_133_axes_0 = const()[name = tensor<string, []>("op_133_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 224]> var_133_cast_fp16 = expand_dims(axes = var_133_axes_0, x = kv_cache_update_mask)[name = tensor<string, []>("op_133_cast_fp16")];
            tensor<int32, [1]> var_134_axes_0 = const()[name = tensor<string, []>("op_134_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 224]> var_134_cast_fp16 = expand_dims(axes = var_134_axes_0, x = var_133_cast_fp16)[name = tensor<string, []>("op_134_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_136_cast_fp16 = mul(x = current_key_1_cast_fp16, y = var_134_cast_fp16)[name = tensor<string, []>("op_136_cast_fp16")];
            tensor<fp16, []> var_73_to_fp16 = const()[name = tensor<string, []>("op_73_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 1, 1, 224]> var_137_cast_fp16 = sub(x = var_73_to_fp16, y = var_134_cast_fp16)[name = tensor<string, []>("op_137_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_138_cast_fp16 = mul(x = var_51_cast_fp16_0, y = var_137_cast_fp16)[name = tensor<string, []>("op_138_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> key_1_cast_fp16 = add(x = var_136_cast_fp16, y = var_138_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_140_cast_fp16 = mul(x = current_value_1_cast_fp16, y = var_134_cast_fp16)[name = tensor<string, []>("op_140_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_142_cast_fp16 = mul(x = var_60_cast_fp16_0, y = var_137_cast_fp16)[name = tensor<string, []>("op_142_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> value_1_cast_fp16 = add(x = var_140_cast_fp16, y = var_142_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_145 = const()[name = tensor<string, []>("op_145"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 1]> var_146_cast_fp16 = reshape(shape = var_145, x = query_1_cast_fp16)[name = tensor<string, []>("op_146_cast_fp16")];
            tensor<fp16, []> var_147_to_fp16 = const()[name = tensor<string, []>("op_147_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 8, 64, 1]> var_148_cast_fp16 = mul(x = var_146_cast_fp16, y = var_147_to_fp16)[name = tensor<string, []>("op_148_cast_fp16")];
            tensor<int32, [4]> var_149 = const()[name = tensor<string, []>("op_149"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 224]> var_150_cast_fp16 = reshape(shape = var_149, x = key_1_cast_fp16)[name = tensor<string, []>("op_150_cast_fp16")];
            tensor<bool, []> mh_w_1_transpose_x_0 = const()[name = tensor<string, []>("mh_w_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_1_transpose_y_0 = const()[name = tensor<string, []>("mh_w_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, 1, 224]> mh_w_1_cast_fp16 = matmul(transpose_x = mh_w_1_transpose_x_0, transpose_y = mh_w_1_transpose_y_0, x = var_148_cast_fp16, y = var_150_cast_fp16)[name = tensor<string, []>("mh_w_1_cast_fp16")];
            tensor<int32, [1]> var_154_axes_0 = const()[name = tensor<string, []>("op_154_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 224]> var_154_cast_fp16 = expand_dims(axes = var_154_axes_0, x = decoder_key_padding_mask)[name = tensor<string, []>("op_154_cast_fp16")];
            tensor<int32, [1]> var_155_axes_0 = const()[name = tensor<string, []>("op_155_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 224]> var_155_cast_fp16 = expand_dims(axes = var_155_axes_0, x = var_154_cast_fp16)[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<fp16, [1, 8, 1, 224]> mh_w_3_cast_fp16 = add(x = mh_w_1_cast_fp16, y = var_155_cast_fp16)[name = tensor<string, []>("mh_w_3_cast_fp16")];
            tensor<fp16, [1, 8, 1, 224]> var_158_cast_fp16 = softmax(axis = var_72, x = mh_w_3_cast_fp16)[name = tensor<string, []>("op_158_cast_fp16")];
            tensor<int32, [4]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 224]> var_160_cast_fp16 = reshape(shape = var_159, x = value_1_cast_fp16)[name = tensor<string, []>("op_160_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 64, 1]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_160_cast_fp16, y = var_158_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<int32, [4]> var_163 = const()[name = tensor<string, []>("op_163"), val = tensor<int32, [4]>([1, 512, 1, -1])];
            tensor<fp16, [1, 512, 1, 1]> input_1_cast_fp16 = reshape(shape = var_163, x = attn_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [2]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_169 = const()[name = tensor<string, []>("op_169"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> obj_7_pad_type_0 = const()[name = tensor<string, []>("obj_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> obj_7_pad_0 = const()[name = tensor<string, []>("obj_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_o_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55147264)))];
            tensor<fp16, [512]> layers_0_self_attn_o_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55671616)))];
            tensor<fp16, [1, 512, 1, 1]> obj_7_cast_fp16 = conv(bias = layers_0_self_attn_o_proj_bias_to_fp16, dilations = var_169, groups = var_79, pad = obj_7_pad_0, pad_type = obj_7_pad_type_0, strides = var_167, weight = layers_0_self_attn_o_proj_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("obj_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = obj_7_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> var_179 = const()[name = tensor<string, []>("op_179"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_3_cast_fp16 = reduce_mean(axes = var_179, keep_dims = var_80, x = inputs_3_cast_fp16)[name = tensor<string, []>("channels_mean_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_3_cast_fp16 = sub(x = inputs_3_cast_fp16, y = channels_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_sq_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = zero_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_sq_3_cast_fp16")];
            tensor<int32, [1]> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> var_184_cast_fp16 = reduce_mean(axes = var_183, keep_dims = var_80, x = zero_mean_sq_3_cast_fp16)[name = tensor<string, []>("op_184_cast_fp16")];
            tensor<fp16, []> var_185_to_fp16 = const()[name = tensor<string, []>("op_185_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1]> var_186_cast_fp16 = add(x = var_184_cast_fp16, y = var_185_to_fp16)[name = tensor<string, []>("op_186_cast_fp16")];
            tensor<fp32, []> denom_3_epsilon_0 = const()[name = tensor<string, []>("denom_3_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1]> denom_3_cast_fp16 = rsqrt(epsilon = denom_3_epsilon_0, x = var_186_cast_fp16)[name = tensor<string, []>("denom_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> out_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = denom_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [512]> obj_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_9_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55672704)))];
            tensor<fp16, [512]> obj_9_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_9_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55673792)))];
            tensor<fp16, []> obj_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1]> obj_9_cast_fp16 = batch_norm(beta = obj_9_beta_0_to_fp16, epsilon = obj_9_epsilon_0_to_fp16, gamma = obj_9_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_3_cast_fp16)[name = tensor<string, []>("obj_9_cast_fp16")];
            tensor<int32, [2]> var_201 = const()[name = tensor<string, []>("op_201"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_3_pad_type_0 = const()[name = tensor<string, []>("query_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_3_pad_0 = const()[name = tensor<string, []>("query_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_encoder_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55674880)))];
            tensor<fp16, [512]> layers_0_encoder_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56199232)))];
            tensor<fp16, [1, 512, 1, 1]> query_3_cast_fp16 = conv(bias = layers_0_encoder_attn_q_proj_bias_to_fp16, dilations = var_203, groups = var_79, pad = query_3_pad_0, pad_type = query_3_pad_type_0, strides = var_201, weight = layers_0_encoder_attn_q_proj_weight_to_fp16, x = obj_9_cast_fp16)[name = tensor<string, []>("query_3_cast_fp16")];
            tensor<int32, [2]> var_207 = const()[name = tensor<string, []>("op_207"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> key_3_pad_type_0 = const()[name = tensor<string, []>("key_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> key_3_pad_0 = const()[name = tensor<string, []>("key_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_encoder_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56200320)))];
            tensor<fp16, [1, 512, 1, 1500]> key_3_cast_fp16 = conv(dilations = var_209, groups = var_79, pad = key_3_pad_0, pad_type = key_3_pad_type_0, strides = var_207, weight = layers_0_encoder_attn_k_proj_weight_to_fp16, x = encoder_output_embeds)[name = tensor<string, []>("key_3_cast_fp16")];
            tensor<int32, [2]> var_214 = const()[name = tensor<string, []>("op_214"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_216 = const()[name = tensor<string, []>("op_216"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> value_3_pad_type_0 = const()[name = tensor<string, []>("value_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> value_3_pad_0 = const()[name = tensor<string, []>("value_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_encoder_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56724672)))];
            tensor<fp16, [512]> layers_0_encoder_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57249024)))];
            tensor<fp16, [1, 512, 1, 1500]> value_3_cast_fp16 = conv(bias = layers_0_encoder_attn_v_proj_bias_to_fp16, dilations = var_216, groups = var_79, pad = value_3_pad_0, pad_type = value_3_pad_type_0, strides = var_214, weight = layers_0_encoder_attn_v_proj_weight_to_fp16, x = encoder_output_embeds)[name = tensor<string, []>("value_3_cast_fp16")];
            tensor<int32, [4]> var_220 = const()[name = tensor<string, []>("op_220"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 1]> var_221_cast_fp16 = reshape(shape = var_220, x = query_3_cast_fp16)[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<fp16, []> var_222_to_fp16 = const()[name = tensor<string, []>("op_222_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 8, 64, 1]> var_223_cast_fp16 = mul(x = var_221_cast_fp16, y = var_222_to_fp16)[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<int32, [4]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 1500]> var_225_cast_fp16 = reshape(shape = var_224, x = key_3_cast_fp16)[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<bool, []> mh_w_5_transpose_x_0 = const()[name = tensor<string, []>("mh_w_5_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_5_transpose_y_0 = const()[name = tensor<string, []>("mh_w_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, 1, 1500]> mh_w_5_cast_fp16 = matmul(transpose_x = mh_w_5_transpose_x_0, transpose_y = mh_w_5_transpose_y_0, x = var_223_cast_fp16, y = var_225_cast_fp16)[name = tensor<string, []>("mh_w_5_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1500]> var_228_cast_fp16 = softmax(axis = var_72, x = mh_w_5_cast_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<int32, [4]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 1500]> var_230_cast_fp16 = reshape(shape = var_229, x = value_3_cast_fp16)[name = tensor<string, []>("op_230_cast_fp16")];
            tensor<bool, []> attn_3_transpose_x_0 = const()[name = tensor<string, []>("attn_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_3_transpose_y_0 = const()[name = tensor<string, []>("attn_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 64, 1]> attn_3_cast_fp16 = matmul(transpose_x = attn_3_transpose_x_0, transpose_y = attn_3_transpose_y_0, x = var_230_cast_fp16, y = var_228_cast_fp16)[name = tensor<string, []>("attn_3_cast_fp16")];
            tensor<int32, [4]> var_233 = const()[name = tensor<string, []>("op_233"), val = tensor<int32, [4]>([1, 512, 1, -1])];
            tensor<fp16, [1, 512, 1, 1]> input_3_cast_fp16 = reshape(shape = var_233, x = attn_3_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_239 = const()[name = tensor<string, []>("op_239"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> obj_11_pad_type_0 = const()[name = tensor<string, []>("obj_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> obj_11_pad_0 = const()[name = tensor<string, []>("obj_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_0_encoder_attn_o_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_o_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57250112)))];
            tensor<fp16, [512]> layers_0_encoder_attn_o_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_o_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57774464)))];
            tensor<fp16, [1, 512, 1, 1]> obj_11_cast_fp16 = conv(bias = layers_0_encoder_attn_o_proj_bias_to_fp16, dilations = var_239, groups = var_79, pad = obj_11_pad_0, pad_type = obj_11_pad_type_0, strides = var_237, weight = layers_0_encoder_attn_o_proj_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("obj_11_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = obj_11_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, [1]> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_5_cast_fp16 = reduce_mean(axes = var_245, keep_dims = var_80, x = inputs_5_cast_fp16)[name = tensor<string, []>("channels_mean_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_5_cast_fp16 = sub(x = inputs_5_cast_fp16, y = channels_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_sq_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = zero_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_sq_5_cast_fp16")];
            tensor<int32, [1]> var_249 = const()[name = tensor<string, []>("op_249"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> var_250_cast_fp16 = reduce_mean(axes = var_249, keep_dims = var_80, x = zero_mean_sq_5_cast_fp16)[name = tensor<string, []>("op_250_cast_fp16")];
            tensor<fp16, []> var_251_to_fp16 = const()[name = tensor<string, []>("op_251_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1]> var_252_cast_fp16 = add(x = var_250_cast_fp16, y = var_251_to_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<fp32, []> denom_5_epsilon_0 = const()[name = tensor<string, []>("denom_5_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1]> denom_5_cast_fp16 = rsqrt(epsilon = denom_5_epsilon_0, x = var_252_cast_fp16)[name = tensor<string, []>("denom_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> out_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = denom_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [512]> input_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_5_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57775552)))];
            tensor<fp16, [512]> input_5_beta_0_to_fp16 = const()[name = tensor<string, []>("input_5_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57776640)))];
            tensor<fp16, []> input_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1]> input_5_cast_fp16 = batch_norm(beta = input_5_beta_0_to_fp16, epsilon = input_5_epsilon_0_to_fp16, gamma = input_5_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_5_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [2]> var_263 = const()[name = tensor<string, []>("op_263"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_265 = const()[name = tensor<string, []>("op_265"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [2048, 512, 1, 1]> layers_0_fc1_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_weight_to_fp16"), val = tensor<fp16, [2048, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57777728)))];
            tensor<fp16, [2048]> layers_0_fc1_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_bias_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59874944)))];
            tensor<fp16, [1, 2048, 1, 1]> input_7_cast_fp16 = conv(bias = layers_0_fc1_bias_to_fp16, dilations = var_265, groups = var_79, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_263, weight = layers_0_fc1_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_mode_0 = const()[name = tensor<string, []>("input_9_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 2048, 1, 1]> input_9_cast_fp16 = gelu(mode = input_9_mode_0, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [2]> var_271 = const()[name = tensor<string, []>("op_271"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_273 = const()[name = tensor<string, []>("op_273"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 2048, 1, 1]> layers_0_fc2_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_weight_to_fp16"), val = tensor<fp16, [512, 2048, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59879104)))];
            tensor<fp16, [512]> layers_0_fc2_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61976320)))];
            tensor<fp16, [1, 512, 1, 1]> hidden_states_3_cast_fp16 = conv(bias = layers_0_fc2_bias_to_fp16, dilations = var_273, groups = var_79, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_271, weight = layers_0_fc2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> inputs_7_cast_fp16 = add(x = inputs_5_cast_fp16, y = hidden_states_3_cast_fp16)[name = tensor<string, []>("inputs_7_cast_fp16")];
            tensor<int32, []> var_286 = const()[name = tensor<string, []>("op_286"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_293 = const()[name = tensor<string, []>("op_293"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_294 = const()[name = tensor<string, []>("op_294"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_306 = const()[name = tensor<string, []>("op_306"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_7_cast_fp16 = reduce_mean(axes = var_306, keep_dims = var_294, x = inputs_7_cast_fp16)[name = tensor<string, []>("channels_mean_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_7_cast_fp16 = sub(x = inputs_7_cast_fp16, y = channels_mean_7_cast_fp16)[name = tensor<string, []>("zero_mean_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_sq_7_cast_fp16 = mul(x = zero_mean_7_cast_fp16, y = zero_mean_7_cast_fp16)[name = tensor<string, []>("zero_mean_sq_7_cast_fp16")];
            tensor<int32, [1]> var_310 = const()[name = tensor<string, []>("op_310"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> var_311_cast_fp16 = reduce_mean(axes = var_310, keep_dims = var_294, x = zero_mean_sq_7_cast_fp16)[name = tensor<string, []>("op_311_cast_fp16")];
            tensor<fp16, []> var_312_to_fp16 = const()[name = tensor<string, []>("op_312_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1]> var_313_cast_fp16 = add(x = var_311_cast_fp16, y = var_312_to_fp16)[name = tensor<string, []>("op_313_cast_fp16")];
            tensor<fp32, []> denom_7_epsilon_0 = const()[name = tensor<string, []>("denom_7_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1]> denom_7_cast_fp16 = rsqrt(epsilon = denom_7_epsilon_0, x = var_313_cast_fp16)[name = tensor<string, []>("denom_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> out_7_cast_fp16 = mul(x = zero_mean_7_cast_fp16, y = denom_7_cast_fp16)[name = tensor<string, []>("out_7_cast_fp16")];
            tensor<fp16, [512]> obj_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_13_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61977408)))];
            tensor<fp16, [512]> obj_13_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_13_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61978496)))];
            tensor<fp16, []> obj_13_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_13_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1]> obj_13_cast_fp16 = batch_norm(beta = obj_13_beta_0_to_fp16, epsilon = obj_13_epsilon_0_to_fp16, gamma = obj_13_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_7_cast_fp16)[name = tensor<string, []>("obj_13_cast_fp16")];
            tensor<int32, [2]> var_328 = const()[name = tensor<string, []>("op_328"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_330 = const()[name = tensor<string, []>("op_330"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_5_pad_type_0 = const()[name = tensor<string, []>("query_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_5_pad_0 = const()[name = tensor<string, []>("query_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61979584)))];
            tensor<fp16, [512]> layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62503936)))];
            tensor<fp16, [1, 512, 1, 1]> query_5_cast_fp16 = conv(bias = layers_1_self_attn_q_proj_bias_to_fp16, dilations = var_330, groups = var_293, pad = query_5_pad_0, pad_type = query_5_pad_type_0, strides = var_328, weight = layers_1_self_attn_q_proj_weight_to_fp16, x = obj_13_cast_fp16)[name = tensor<string, []>("query_5_cast_fp16")];
            tensor<int32, [2]> var_334 = const()[name = tensor<string, []>("op_334"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_336 = const()[name = tensor<string, []>("op_336"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> current_key_3_pad_type_0 = const()[name = tensor<string, []>("current_key_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> current_key_3_pad_0 = const()[name = tensor<string, []>("current_key_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62505024)))];
            tensor<fp16, [1, 512, 1, 1]> current_key_3_cast_fp16 = conv(dilations = var_336, groups = var_293, pad = current_key_3_pad_0, pad_type = current_key_3_pad_type_0, strides = var_334, weight = layers_1_self_attn_k_proj_weight_to_fp16, x = obj_13_cast_fp16)[name = tensor<string, []>("current_key_3_cast_fp16")];
            tensor<int32, [2]> var_341 = const()[name = tensor<string, []>("op_341"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_343 = const()[name = tensor<string, []>("op_343"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> current_value_3_pad_type_0 = const()[name = tensor<string, []>("current_value_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> current_value_3_pad_0 = const()[name = tensor<string, []>("current_value_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63029376)))];
            tensor<fp16, [512]> layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63553728)))];
            tensor<fp16, [1, 512, 1, 1]> current_value_3_cast_fp16 = conv(bias = layers_1_self_attn_v_proj_bias_to_fp16, dilations = var_343, groups = var_293, pad = current_value_3_pad_0, pad_type = current_value_3_pad_type_0, strides = var_341, weight = layers_1_self_attn_v_proj_weight_to_fp16, x = obj_13_cast_fp16)[name = tensor<string, []>("current_value_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_350_cast_fp16 = mul(x = current_key_3_cast_fp16, y = var_134_cast_fp16)[name = tensor<string, []>("op_350_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_352_cast_fp16 = mul(x = var_51_cast_fp16_1, y = var_137_cast_fp16)[name = tensor<string, []>("op_352_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> key_5_cast_fp16 = add(x = var_350_cast_fp16, y = var_352_cast_fp16)[name = tensor<string, []>("key_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_354_cast_fp16 = mul(x = current_value_3_cast_fp16, y = var_134_cast_fp16)[name = tensor<string, []>("op_354_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> var_356_cast_fp16 = mul(x = var_60_cast_fp16_1, y = var_137_cast_fp16)[name = tensor<string, []>("op_356_cast_fp16")];
            tensor<fp16, [1, 512, 1, 224]> value_5_cast_fp16 = add(x = var_354_cast_fp16, y = var_356_cast_fp16)[name = tensor<string, []>("value_5_cast_fp16")];
            tensor<int32, [4]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 1]> var_360_cast_fp16 = reshape(shape = var_359, x = query_5_cast_fp16)[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<fp16, []> var_361_to_fp16 = const()[name = tensor<string, []>("op_361_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 8, 64, 1]> var_362_cast_fp16 = mul(x = var_360_cast_fp16, y = var_361_to_fp16)[name = tensor<string, []>("op_362_cast_fp16")];
            tensor<int32, [4]> var_363 = const()[name = tensor<string, []>("op_363"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 224]> var_364_cast_fp16 = reshape(shape = var_363, x = key_5_cast_fp16)[name = tensor<string, []>("op_364_cast_fp16")];
            tensor<bool, []> mh_w_7_transpose_x_0 = const()[name = tensor<string, []>("mh_w_7_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_7_transpose_y_0 = const()[name = tensor<string, []>("mh_w_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, 1, 224]> mh_w_7_cast_fp16 = matmul(transpose_x = mh_w_7_transpose_x_0, transpose_y = mh_w_7_transpose_y_0, x = var_362_cast_fp16, y = var_364_cast_fp16)[name = tensor<string, []>("mh_w_7_cast_fp16")];
            tensor<fp16, [1, 8, 1, 224]> mh_w_9_cast_fp16 = add(x = mh_w_7_cast_fp16, y = var_155_cast_fp16)[name = tensor<string, []>("mh_w_9_cast_fp16")];
            tensor<fp16, [1, 8, 1, 224]> var_372_cast_fp16 = softmax(axis = var_286, x = mh_w_9_cast_fp16)[name = tensor<string, []>("op_372_cast_fp16")];
            tensor<int32, [4]> var_373 = const()[name = tensor<string, []>("op_373"), val = tensor<int32, [4]>([1, 8, 64, -1])];
            tensor<fp16, [1, 8, 64, 224]> var_374_cast_fp16 = reshape(shape = var_373, x = value_5_cast_fp16)[name = tensor<string, []>("op_374_cast_fp16")];
            tensor<bool, []> attn_5_transpose_x_0 = const()[name = tensor<string, []>("attn_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_5_transpose_y_0 = const()[name = tensor<string, []>("attn_5_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 64, 1]> attn_5_cast_fp16 = matmul(transpose_x = attn_5_transpose_x_0, transpose_y = attn_5_transpose_y_0, x = var_374_cast_fp16, y = var_372_cast_fp16)[name = tensor<string, []>("attn_5_cast_fp16")];
            tensor<int32, [4]> var_377 = const()[name = tensor<string, []>("op_377"), val = tensor<int32, [4]>([1, 512, 1, -1])];
            tensor<fp16, [1, 512, 1, 1]> input_11_cast_fp16 = reshape(shape = var_377, x = attn_5_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_381 = const()[name = tensor<string, []>("op_381"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_383 = const()[name = tensor<string, []>("op_383"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> obj_19_pad_type_0 = const()[name = tensor<string, []>("obj_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> obj_19_pad_0 = const()[name = tensor<string, []>("obj_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> layers_1_self_attn_o_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_o_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63554816)))];
            tensor<fp16, [512]> layers_1_self_attn_o_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_o_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64079168)))];
            tensor<fp16, [1, 512, 1, 1]> obj_19_cast_fp16 = conv(bias = layers_1_self_attn_o_proj_bias_to_fp16, dilations = var_383, groups = var_293, pad = obj_19_pad_0, pad_type = obj_19_pad_type_0, strides = var_381, weight = layers_1_self_attn_o_proj_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("obj_19_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> inputs_9_cast_fp16 = add(x = inputs_7_cast_fp16, y = obj_19_cast_fp16)[name = tensor<string, []>("inputs_9_cast_fp16")];
            tensor<int32, [1]> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_9_cast_fp16 = reduce_mean(axes = var_393, keep_dims = var_294, x = inputs_9_cast_fp16)[name = tensor<string, []>("channels_mean_9_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> zero_mean_9_cast_fp16 = sub(x = inputs_9_cast_fp16, y = channels_mean_9_cast_fp16)[name = tensor<string, []>("zero_mean_9_cast_fp16")];
